Repository: TheDoubleL0215/moonly_app
Catalog: lib/l10n/app_*.arb
Languages: hu

# loginScreen_subtitle
source: The friendliest cycle tracker
hu: A legbarátságosabb cikluskövető

# loginScreen_googleLoginButtonText
source: Sign in with Google
hu: Bejelentkezés Google-lal

# loginScreen_loadingButtonText
source: Signing in...
hu: Bejelentkezés...

# registerPage_selectYearOfBirth
source: When were you born?
hu: Mikor születtél?

# registerPage_selectYearOfBirthDescription
source: Since cycles can change over time, this helps us tailor the app to your individual needs!
hu: A ciklusok idővel változhatnak, ha tudjuk hány éves vagy az segít nekünk abban, hogy az alkalmazást személyre szabjuk neked!

# registerPage_continueButtonText
source: Continue
hu: Tovább

# registerPage_backButtonText
source: Back
hu: Vissza

# registerPage_selectLastPeriodTitle
source: When was the first day of your last period?
hu: Mikor volt az előző menstruációd első napja?

# registerPage_selectLastPeriodDescription
source: This helps us determine your next period
hu: Így meg tudjuk határozni a következő menstruációdat

# registerPage_overviewTitle
source: Final step
hu: Utolsó lépés

# registerPage_overviewSubtitle
source: Review the information you provided to make sure it's correct!
hu: Tekintsd át a megadott adatokat hogy biztosan helyesek-e!

# registerPage_yearOfBirth
source: Year of birth
hu: Születési év

# registerPage_lastPeriodStart
source: Last period start
hu: Utolsó menstruáció kezdete

# registerPage_selectCycleLengthTitle
source: How long is your cycle?
hu: Hány napos a ciklusod?

# registerPage_selectCycleLengthDescription
source: Cycle length is from the first day of your period to the day before your next period
hu: A ciklus hossza a menstruáció első napjától a következő menstruáció előtti napig tart

# registerPage_cycleLengthInputLabel
source: Cycle length
hu: Ciklus hossza

# registerPage_cycleLengthInputHint
source: e.g. 28
hu: pl. 28

# registerPage_cycleLengthDays
source: days
hu: nap

# registerPage_cycleLengthUnknown
source: I don't know
hu: Nem tudom

# registerPage_cycleLength
source: Cycle length
hu: Ciklus hossza

# registerPage_periodLength
source: Period length
hu: Menstruáció hossza

# registerPage_acceptTerms
source: I accept the terms
hu: Elfogadom a feltételeket

# registerPage_acceptTermsDescription
source: By using the app, I accept the terms of use and privacy policy
hu: Az alkalmazás használatával elfogadom a felhasználási feltételeket és az adatvédelmi irányelveket

# registerPage_finishButtonText
source: Finish
hu: Befejezés

# appbar_mainpageText
source: Mainpage
hu: Főoldal

# appbar_calendarText
source: Calendar
hu: Naptár

# appbar_knowledgeText
source: Knowledge
hu: Tudástár

# appbar_profile
source: Profile
hu: Profil

# cycleDiagramCurrentDayCounter
source: Day {day}
hu: {day}. nap

# cycleDiagramNextDayCounter
source: After {day} days
hu: {day}. nap múlva

# cycleDiagramPeriodCurrent
source: period
hu: menstruáció

# cycleDiagramOvulationCurrent
source: ovulation
hu: ovuláció

# cycleDiagramPmsCurrent
source: pms period
hu: pms időszak

# cycleDiagramFertileWindowCurrent
source: fertile window
hu: termékeny időszak

# cycleDiagramFollicularPhaseCurrent
source: follicular phase
hu: follikuláris fázis

# calendar_bleedingText
source: bleeding
hu: vérzés
